trade/src/Documents/ЭлектронныйЗаказЗаявка/ЭлектронныйЗаказЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронныйЗаказЗаявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТитулГрузоотправителяФункция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяЗаказНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяЗаказДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулГрузоотправителяГрузоотправитель</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулГрузоотправителяСоставитель</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулГрузоотправителяПеревозчик</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяЗаявленныеДатаВремяПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаПричинаОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулПеревозчикаЛицоОтветственноеЗаПеревозку</name>
    <type>
      <types>DefinedType.ФизическоеЛицоЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулПеревозчикаСоставитель</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИДМинтранс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПолученныйТитул</name>
    <type>
      <types>EnumRef.ТипыЭлементовРегламентаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийТитул</name>
    <type>
      <types>EnumRef.ТипыЭлементовРегламентаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>РольУчастника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГрузоотправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеПолучателиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийШаг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийШагВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ДокументыОснованияЭСВ_ЭПД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Documents/ЭлектронныйЗаказЗаявка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ЭлектронныйЗаказЗаявка.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды")
		И ПравоДоступа("Добавление", Метаданные.Документы.ЭлектроннаяТранспортнаяНакладная) Тогда
		МодульСозданиеНаОсновании = ОбщегоНазначения.ОбщийМодуль("СозданиеНаОсновании");
		КомандаСозданияНаОсновании = МодульСозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.ЭлектроннаяТранспортнаяНакладная);
		КомандаСозданияНаОсновании.ОтображениеКнопки = ОтображениеКнопки.КартинкаИТекст;
		Возврат КомандаСозданияНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТитулГрузоотправителяЗаказНомер");
	Поля.Добавить("ТитулГрузоотправителяФункция");
	Поля.Добавить("ЭтоВходящий");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Номер = Данные.Номер;
	Направление = "";
	
	Если ЗначениеЗаполнено(Данные.ТитулГрузоотправителяФункция) Тогда
		ФункцияДокумента = НРег(Данные.ТитулГрузоотправителяФункция);
	Иначе
		ФункцияДокумента = "заказ (заявка)";
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ТитулГрузоотправителяЗаказНомер) Тогда
		Номер = Данные.ТитулГрузоотправителяЗаказНомер;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ЭтоВходящий) Тогда
		Направление = ?(Данные.ЭтоВходящий, " " + НСтр("ru = 'входящий'"), "");
	КонецЕсли;
	
	Дата = Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Электронный %1%2 № %3 от %4'"), ФункцияДокумента, Направление, Номер, Дата);
	СтандартнаяОбработка = Ложь;
		
КонецПроцедуры

#КонецОбласти
